#+AUTHOR: Richie Morrisroe 
#+TITLE: How do R love thee, OOP? Let me count the ways
#+OPTIONS: toc:nil  
#+OPTIONS: ^:nil
#+BEGIN_SRC R :session :results none :exports none
  require(dplyr)
  require(sfobjects)
#+END_SRC
#+BEGIN_SRC R :session :results none :exports none
  states <- readRDS("statelist.rds")
  quotes <- lapply(states, function (x) x$quote)
  test_quote <- quotes[[6]]
  tqdf <- as.data.frame(test_quote)
  names(tqdf) <- with(tqdf, gsub("^x\\.", "",  x=names(tqdf)))
#+END_SRC
* What is a generic function?
- Essentially everything that works throughout the language
#+BEGIN_SRC R :session :results output :exports both
  length(methods("print"))
  length(methods("plot"))
  length(methods("["))
  length(methods("$"))
  length(methods("as.data.frame"))
#+END_SRC

#+RESULTS:
: [1] 186
: [1] 29
: [1] 27
: [1] 7
: [1] 27

* Testing our Generic
#+BEGIN_SRC R :session :results value :exports both
  testdf <- data.frame(
      first=sample(letters,
                   size=26,
                   replace=TRUE),
      second=sample(1:1000, size=26, replace=TRUE))
  foobar_df <- foobar_func(testdf)
  print(foobar_df) %>% head()
#+END_SRC

#+RESULTS:
| u | 288 |
| l | 848 |
| t | 515 |
| b |  66 |
| j | 231 |
| l |  79 |
- D'oh! This didn't work, because S3 dispatches on the first argument of the class vector.
# - If we alter ~foobar_func~ to return a list with foobar first, we'll get the correct behaviour. 

* Fixing our Generic
#+BEGIN_SRC R :session :results value :exports code
  foobar_func <- function(df) {
      class(df) <- c("foobar", "data.frame")
      df
  }
print(foobar_df)

#+END_SRC

#+RESULTS:
: foobar!
- That's almost the entirety of S3

* Creating a new generic
#+BEGIN_SRC R :session :results output :exports both
    baz <- function (x, ...) {
       UseMethod("baz", x)
     }
    baz.foobar <- function(x, ...) {
        print ("Worst method ever")
    }
    baz.default <- function(x, ...) {
        print("God, this is a boring example")
    }
  baz(foobar_df)
  baz(testdf)
#+END_SRC

#+RESULTS:
: God, this is a boring example

- A call to ~UseMethod~ is then made for the generic
- It first looks for ~foobar~, then ~data.frame~ and then a method called ~default~
# - If it doesn't find one, it signals an error





# * R Infrastructure for Generics

# #+BEGIN_SRC R :session :results none :exports code
#   method.skeleton(summary, signature="foobar")
# #+END_SRC

# - ~method.skeleton~ writes to a file a skeleton function containing the appropriate arguments for the generic
# - You then create behaviour for the function in this setMethod call

# #+BEGIN_SRC R :session :results none :exports code
#   setMethod("summary",
#       signature(object = "foobar"),
#       function (object, ...) 
#       {
#           head(object)
#       }
#   )

# #+END_SRC




